Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.141/PIC32CM-LS00/atdf/PIC32CM5164LS00048.atdf
      <value-group name="OPAMP_OPAMPCTRL2__MUXNEG">
        <value name="OA2NEG" caption="OPAMP2 Negative Input" value="0x0"/>
        <value name="OA2TAP" caption="OPAMP2 Resistor ladder taps" value="0x1"/>
        <value name="DAC_REFBUF" caption="DAC VOUT0 or OPAMP Reference Output Voltage (REFBUF)" value="0x2"/>
        <value name="OA2OUT" caption="OPAMP2 Output" value="0x3"/>
        <value name="OA0NEG" caption="OPAMP0 Negative Input" value="0x4"/>
        <value name="OA1NEG" caption="OPAMP1 Negative Input" value="0x5"/>
      </value-group>
      <value-group name="OPAMP_RESCTRL__REFBUFLEVEL">
        <value name="1_1V" caption="1.1V" value="0x0"/>
        <value name="1_25V" caption="1.25V" value="0x1"/>
        <value name="1_6V" caption="1.6V" value="0x2"/>
      </value-group>
      <value-group name="OPAMP_RESCTRL__POTMUX">
        <value name="14R_2R" caption="Gain = 0.14" value="0x0"/>
        <value name="12R_4R" caption="Gain = 0.33" value="0x1"/>
        <value name="8R_8R" caption="Gain = 1" value="0x2"/>
        <value name="6R_10R" caption="Gain = 1.67" value="0x3"/>
        <value name="4R_12R" caption="Gain = 3" value="0x4"/>
        <value name="3R_13R" caption="Gain = 4.33" value="0x5"/>
        <value name="2R_14R" caption="Gain = 7" value="0x6"/>
        <value name="R_15R" caption="Gain = 15" value="0x7"/>
      </value-group>
      <value-group name="OPAMP_RESCTRL__RES1MUX">
        <value name="DAC" caption="DAC VOUT0 Output" value="0x0"/>
        <value name="REFBUF" caption="OPAMP Reference Buffer Output" value="0x1"/>
      </value-group>
    </module>
    <module name="OSC32KCTRL" id="U2246" version="4.0.0" caption="32k Oscillators Control">
      <register-group name="OSC32KCTRL" caption="32k Oscillators Control">
        <register name="INTENCLR" offset="0x0" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="XOSC32KRDY" caption="XOSC32K Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="CLKFAIL" caption="XOSC32K Clock Failure Detector Interrupt Enable" mask="0x4"/>
        </register>
        <register name="INTENSET" offset="0x4" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="XOSC32KRDY" caption="XOSC32K Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="CLKFAIL" caption="XOSC32K Clock Failure Detector Interrupt Enable" mask="0x4"/>
        </register>
        <register name="INTFLAG" offset="0x8" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag Status and Clear">
          <bitfield name="XOSC32KRDY" caption="XOSC32K Ready" mask="0x1"/>
          <bitfield name="CLKFAIL" caption="XOSC32K Clock Failure Detector" mask="0x4"/>
        </register>
        <register name="STATUS" offset="0xC" rw="R" size="4" initval="0x00000000" caption="Power and Clocks Status">
          <bitfield name="XOSC32KRDY" caption="XOSC32K Ready" mask="0x1"/>
          <bitfield name="CLKFAIL" caption="XOSC32K Clock Failure Detector" mask="0x4"/>
          <bitfield name="CLKSW" caption="XOSC32K Clock switch" mask="0x8"/>
          <bitfield name="ULP32KSW" caption="OSCULP32K Clock Switch" mask="0x10"/>
        </register>
        <register name="RTCCTRL" offset="0x10" rw="RW" size="1" initval="0x00" caption="RTC Clock Selection">
          <bitfield name="RTCSEL" caption="RTC Clock Selection" mask="0x7" values="OSC32KCTRL_RTCCTRL__RTCSEL"/>
        </register>
        <register name="XOSC32K" offset="0x14" rw="RW" size="2" initval="0x0080" caption="32kHz External Crystal Oscillator (XOSC32K) Control">
          <bitfield name="ENABLE" caption="Oscillator Enable" mask="0x2"/>
          <bitfield name="XTALEN" caption="Crystal Oscillator Enable" mask="0x4"/>
          <bitfield name="EN32K" caption="32kHz Output Enable" mask="0x8"/>
          <bitfield name="EN1K" caption="1kHz Output Enable" mask="0x10"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
          <bitfield name="STARTUP" caption="Oscillator Start-Up Time" mask="0x700" values="OSC32KCTRL_XOSC32K__STARTUP"/>
          <bitfield name="WRTLOCK" caption="Write Lock" mask="0x1000"/>
        </register>
        <register name="CFDCTRL" offset="0x16" rw="RW" size="1" initval="0x00" caption="Clock Failure Detector Control">
          <bitfield name="CFDEN" caption="Clock Failure Detector Enable" mask="0x1"/>
          <bitfield name="SWBACK" caption="Clock Switch Back Enable" mask="0x2"/>
          <bitfield name="CFDPRESC" caption="Clock Failure Detector Prescaler" mask="0x4"/>
        </register>
        <register name="EVCTRL" offset="0x17" rw="RW" size="1" initval="0x00" caption="Event Control">
          <bitfield name="CFDEO" caption="Clock Failure Detector Event Output Enable" mask="0x1"/>
        </register>
        <register name="OSCULP32K" offset="0x1C" rw="RW" size="4" initval="0x00000000" caption="32kHz Ultra Low Power Internal Oscillator (OSCULP32K) Control">
          <bitfield name="ULP32KSW" caption="OSCULP32K Clock Switch Enable" mask="0x20"/>
          <bitfield name="WRTLOCK" caption="Write Lock" mask="0x8000"/>
        </register>
      </register-group>
      <value-group name="OSC32KCTRL_RTCCTRL__RTCSEL">
        <value name="ULP1K" caption="1.024kHz from 32kHz internal ULP oscillator" value="0"/>
        <value name="ULP32K" caption="32.768kHz from 32kHz internal ULP oscillator" value="1"/>
        <value name="XOSC1K" caption="1.024kHz from 32.768kHz external crystal oscillator" value="4"/>
        <value name="XOSC32K" caption="32.768kHz from 32.768kHz external crystal oscillator" value="5"/>
      </value-group>
      <value-group name="OSC32KCTRL_XOSC32K__STARTUP">
        <value name="CYCLE2048" caption="62.5 ms" value="0"/>
        <value name="CYCLE4096" caption="125 ms" value="1"/>
        <value name="CYCLE16384" caption="500 ms" value="2"/>
        <value name="CYCLE32768" caption="1000 ms" value="3"/>
        <value name="CYCLE65536" caption="2000 ms" value="4"/>
        <value name="CYCLE131072" caption="4000 ms" value="5"/>
        <value name="CYCLE262144" caption="8000 ms" value="6"/>
      </value-group>
    </module>
