Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.141/PIC32CM-LS00/atdf/PIC32CM5164LS00048.atdf
    <module name="SUPC" id="U2117" version="5a0" caption="Supply Controller">
      <register-group name="SUPC" caption="Supply Controller">
        <register name="INTENCLR" offset="0x0" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="BOD33RDY" caption="BOD33 Ready" mask="0x1"/>
          <bitfield name="BOD33DET" caption="BOD33 Detection" mask="0x2"/>
          <bitfield name="B33SRDY" caption="BOD33 Synchronization Ready" mask="0x4"/>
          <bitfield name="VREGRDY" caption="Voltage Regulator Ready" mask="0x100"/>
          <bitfield name="VCORERDY" caption="VDDCORE Ready" mask="0x400"/>
          <bitfield name="ULPVREFRDY" caption="ULPVREF Voltage Reference Ready" mask="0x800"/>
          <bitfield name="VCOREPLLRDY" caption="Voltage Regulator PLL Ready" mask="0x40000"/>
        </register>
        <register name="INTENSET" offset="0x4" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="BOD33RDY" caption="BOD33 Ready" mask="0x1"/>
          <bitfield name="BOD33DET" caption="BOD33 Detection" mask="0x2"/>
          <bitfield name="B33SRDY" caption="BOD33 Synchronization Ready" mask="0x4"/>
          <bitfield name="VREGRDY" caption="Voltage Regulator Ready" mask="0x100"/>
          <bitfield name="VCORERDY" caption="VDDCORE Ready" mask="0x400"/>
          <bitfield name="ULPVREFRDY" caption="ULPVREF Voltage Reference Ready" mask="0x800"/>
          <bitfield name="VCOREPLLRDY" caption="Voltage Regulator PLL Ready" mask="0x40000"/>
        </register>
        <register name="INTFLAG" offset="0x8" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag Status and Clear">
          <bitfield name="BOD33RDY" caption="BOD33 Ready" mask="0x1"/>
          <bitfield name="BOD33DET" caption="BOD33 Detection" mask="0x2"/>
          <bitfield name="B33SRDY" caption="BOD33 Synchronization Ready" mask="0x4"/>
          <bitfield name="VREGRDY" caption="Voltage Regulator Ready" mask="0x100"/>
          <bitfield name="VCORERDY" caption="VDDCORE Ready" mask="0x400"/>
          <bitfield name="ULPVREFRDY" caption="ULPVREF Voltage Reference Ready" mask="0x800"/>
          <bitfield name="VCOREPLLRDY" caption="Voltage Regulator PLL Ready" mask="0x40000"/>
        </register>
        <register name="STATUS" offset="0xC" rw="R" size="4" initval="0x00000000" caption="Power and Clocks Status">
          <bitfield name="BOD33RDY" caption="BOD33 Ready" mask="0x1"/>
          <bitfield name="BOD33DET" caption="BOD33 Detection" mask="0x2"/>
          <bitfield name="B33SRDY" caption="BOD33 Synchronization Ready" mask="0x4"/>
          <bitfield name="VREGRDY" caption="Voltage Regulator Ready" mask="0x100"/>
          <bitfield name="VCORERDY" caption="VDDCORE Ready" mask="0x400"/>
          <bitfield name="ULPVREFRDY" caption="Low Power Voltage Reference Ready" mask="0x1000"/>
          <bitfield name="VCOREPLLRDY" caption="Voltage Regulator PLL Ready" mask="0x40000"/>
        </register>
        <register name="BOD33" offset="0x10" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="BOD33 Control">
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="HYST" caption="Hysteresis Enable" mask="0x4"/>
          <bitfield name="ACTION" caption="Action when Threshold Crossed" mask="0x18" values="SUPC_BOD33__ACTION"/>
          <bitfield name="STDBYCFG" caption="Configuration in Standby mode" mask="0x20"/>
          <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x40"/>
          <bitfield name="ACTCFG" caption="Configuration in Active mode" mask="0x100"/>
          <bitfield name="VREFSEL" caption="BOD33 Voltage Reference Selection" mask="0x800" values="SUPC_BOD33__VREFSEL"/>
          <bitfield name="PSEL" caption="Prescaler Select" mask="0xF000" values="SUPC_BOD33__PSEL"/>
          <bitfield name="LEVEL" caption="Threshold Level for VDD" mask="0x3F0000"/>
        </register>
        <register name="VREG" offset="0x18" rw="RW" size="4" initval="0x00000002" caption="VREG Control">
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="SEL" caption="Voltage Regulator Selection in active mode" mask="0xC" values="SUPC_VREG__SEL"/>
          <bitfield name="STDBYPL0" caption="Standby in PL0" mask="0x20"/>
          <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x40"/>
          <bitfield name="LPEFF" caption="Low Power efficiency" mask="0x100"/>
          <bitfield name="VREFSEL" caption="Voltage Regulator Voltage Reference Selection" mask="0x200" values="SUPC_VREG__VREFSEL"/>
          <bitfield name="VSVSTEP" caption="Voltage Scaling Voltage Step" mask="0xF0000"/>
          <bitfield name="VSPER" caption="Voltage Scaling Period" mask="0xFF000000"/>
        </register>
        <register name="VREF" offset="0x1C" rw="RW" size="4" initval="0x00000000" caption="VREF Control">
          <bitfield name="VREFOE" caption="Voltage Reference Output Enable" mask="0x4"/>
          <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
          <bitfield name="SEL" caption="Voltage Reference Selection for ADC/DAC" mask="0xF0000" values="SUPC_VREF__SEL"/>
        </register>
        <register name="VREGPLL" offset="0x20" rw="RW" size="4" initval="0x00000000" caption="VREGPLL Control">
          <bitfield name="ENABLE" caption="Vreg PLL Enable" mask="0x2"/>
          <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x40"/>
          <bitfield name="STARTUP" caption="Startup Time" mask="0xF00"/>
        </register>
        <register name="EVCTRL" offset="0x2C" rw="RW" size="4" initval="0x00000000" caption="Event Control">
          <bitfield name="BOD33DETEO" caption="BOD33 Detection Event Output Enable" mask="0x2"/>
        </register>
      </register-group>
      <value-group name="SUPC_BOD33__ACTION">
        <value name="NONE" caption="No action" value="0x0"/>
        <value name="RESET" caption="The BOD33 generates a reset" value="0x1"/>
        <value name="INT" caption="The BOD33 generates an interrupt" value="0x2"/>
      </value-group>
      <value-group name="SUPC_BOD33__PSEL">
        <value name="DIV2" caption="Divide clock by 2" value="0x0"/>
        <value name="DIV4" caption="Divide clock by 4" value="0x1"/>
        <value name="DIV8" caption="Divide clock by 8" value="0x2"/>
        <value name="DIV16" caption="Divide clock by 16" value="0x3"/>
        <value name="DIV32" caption="Divide clock by 32" value="0x4"/>
        <value name="DIV64" caption="Divide clock by 64" value="0x5"/>
        <value name="DIV128" caption="Divide clock by 128" value="0x6"/>
        <value name="DIV256" caption="Divide clock by 256" value="0x7"/>
        <value name="DIV512" caption="Divide clock by 512" value="0x8"/>
        <value name="DIV1024" caption="Divide clock by 1024" value="0x9"/>
        <value name="DIV2048" caption="Divide clock by 2048" value="0xA"/>
        <value name="DIV4096" caption="Divide clock by 4096" value="0xB"/>
        <value name="DIV8192" caption="Divide clock by 8192" value="0xC"/>
        <value name="DIV16384" caption="Divide clock by 16384" value="0xD"/>
        <value name="DIV32768" caption="Divide clock by 32768" value="0xE"/>
        <value name="DIV65536" caption="Divide clock by 65536" value="0xF"/>
      </value-group>
      <value-group name="SUPC_BOD33__VREFSEL">
        <value name="SEL_VREF" caption="Selects VREF for the BOD33" value="0"/>
        <value name="SEL_ULPVREF" caption="Selects ULPVREF for the BOD33" value="1"/>
      </value-group>
      <value-group name="SUPC_VREG__VREFSEL">
        <value name="SEL_VREF" caption="Selects VREF for the VREG" value="0"/>
        <value name="SEL_ULPVREF" caption="Selects ULPVREF for the VREG" value="1"/>
      </value-group>
